{
  "$comment": "GENERATED by scripts/sync-sign-vocabulary.js — do not edit by hand. Run `npm run sync:vocab`.",
  "generatedFrom": "frontend/src/components/SignAvatar.js",
  "totalSignable": 486,
  "excludedFromPrompt": [
    "BASICALLY",
    "ILL",
    "IM",
    "SUBSCRIBE",
    "THATS",
    "WELL",
    "YEAH",
    "YOURE",
    "YOUVE"
  ],
  "signable": [
    "ABILITY",
    "ABLE",
    "ABOUT",
    "ACCELERATE",
    "ACCIDENT",
    "ACCORDING",
    "ACCURACY",
    "ACT",
    "ACTIVATE",
    "ACTIVE",
    "ACTUALLY",
    "ADAPTATION",
    "ADD",
    "ADJUST",
    "AFTER",
    "AGAIN",
    "AI",
    "ALL",
    "ALLOW",
    "ALMOST",
    "ALSO",
    "ALWAYS",
    "ANALOGY",
    "AND",
    "ANIMAL",
    "ANOTHER",
    "ANSWER",
    "ANY",
    "APPLY",
    "AREA",
    "AROUND",
    "AS",
    "ASK",
    "ASL",
    "ASSISTANT",
    "ASSOCIATED",
    "ASTEROID",
    "ATMOSPHERE",
    "ATTENTION",
    "AXE",
    "BACK",
    "BAD",
    "BALANCE",
    "BALL",
    "BASICALLY",
    "BECAUSE",
    "BECOME",
    "BEFORE",
    "BEHAVE",
    "BEHAVIOR",
    "BENEFIT",
    "BETWEEN",
    "BIG",
    "BIGGER",
    "BILLION",
    "BODY",
    "BOTH",
    "BRAIN",
    "BREAK",
    "BRIGHT",
    "BRING",
    "BUILD",
    "BUNCH",
    "BUT",
    "BUY",
    "BY",
    "CALCULATE",
    "CALL",
    "CAN",
    "CAR",
    "CARE",
    "CASE",
    "CAUSE",
    "CERTAIN",
    "CHALLENGE",
    "CHANGE",
    "CHATBOT",
    "CHIP",
    "CHOICE",
    "CHOOSE",
    "CHOSE",
    "CLASSIFY",
    "CLOSE",
    "COMBINE",
    "COME",
    "COMMON",
    "COMPLICATED",
    "COMPONENT",
    "COMPUTE",
    "COMPUTER",
    "CONNECT",
    "CONNECTION",
    "CONSTANT",
    "CONTACT",
    "CONTINUE",
    "CONVERT",
    "CORRESPOND",
    "COUPLE",
    "COURSE",
    "CRASH",
    "CUT",
    "CYCLE",
    "DATA",
    "DAY",
    "DECREASE",
    "DEEP",
    "DEFINE",
    "DESCENT",
    "DETERMINE",
    "DIAL",
    "DID",
    "DIFFERENT",
    "DIFFICULT",
    "DIGIT",
    "DIRECTION",
    "DISPLACEMENT",
    "DO",
    "DONT",
    "DOWN",
    "DRILL",
    "EACH",
    "EARTH",
    "EASY",
    "EDGE",
    "EITHER",
    "END",
    "ENERGY",
    "ENGINE",
    "ENTIRE",
    "ERROR",
    "EVEN",
    "EXACTLY",
    "EXAMPLE",
    "EXERT",
    "EXPECT",
    "EXPERIMENT",
    "EXPLAIN",
    "EXPRESSION",
    "EXTREME",
    "FEED",
    "FEEDBACK",
    "FEEL",
    "FEW",
    "FINAL",
    "FIND",
    "FINISH",
    "FIRING",
    "FIRST",
    "FLAT",
    "FLOOR",
    "FLY",
    "FOR",
    "FORCE",
    "FORM",
    "FRAME",
    "FRICTION",
    "FULL",
    "FUNCTION",
    "GAVE",
    "GENERATE",
    "GET",
    "GIVE",
    "GIVEN",
    "GLIDE",
    "GO",
    "GOAL",
    "GOOD",
    "GRADIENT",
    "GRAVITY",
    "GREATLY",
    "GROUND",
    "GROUP",
    "HAMMER",
    "HAND",
    "HANDWRITTEN",
    "HAPPEN",
    "HARD",
    "HATE",
    "HE",
    "HELLO",
    "HELP",
    "HERE",
    "HIDDEN",
    "HIGH",
    "HIT",
    "HOLD",
    "HOPE",
    "HORIZONTAL",
    "HOW",
    "HUMAN",
    "I",
    "ICE",
    "IDEA",
    "IF",
    "ILL",
    "IM",
    "IMAGE",
    "IMAGINE",
    "IMPACT",
    "IMPORTANT",
    "INACTIVE",
    "INCREASE",
    "INDEPENDENT",
    "INDICATE",
    "INERTIA",
    "INFLUENCE",
    "INPUT",
    "INSIDE",
    "INTERACT",
    "INTERNET",
    "INTO",
    "INVOLVE",
    "IT",
    "JUMP",
    "JUST",
    "KEEP",
    "KICK",
    "KIND",
    "KNIFE",
    "KNOB",
    "KNOW",
    "LANGUAGE",
    "LARGE",
    "LAST",
    "LAYER",
    "LEAF",
    "LEARN",
    "LEFT",
    "LESS",
    "LET",
    "LETS",
    "LETTER",
    "LEVEL",
    "LIGHT",
    "LIKE",
    "LINE",
    "LINEAR",
    "LIST",
    "LITTLE",
    "LIVE",
    "LONG",
    "LOOK",
    "LOOP",
    "LOSE",
    "LOSS",
    "LOT",
    "LOVE",
    "LOW",
    "MACHINE",
    "MAGNITUDE",
    "MAKE",
    "MANY",
    "MASS",
    "MATH",
    "MATRIX",
    "MAXIMIZE",
    "MAYBE",
    "ME",
    "MEAN",
    "MECHANISM",
    "METER",
    "MIDDLE",
    "MINIMIZE",
    "MODEL",
    "MODERN",
    "MOMENT",
    "MORE",
    "MOTION",
    "MOTIVATED",
    "MOVE",
    "MUCH",
    "NAIL",
    "NEED",
    "NEGATIVE",
    "NETWORK",
    "NEURAL",
    "NEURON",
    "NEW",
    "NEXT",
    "NICE",
    "NO",
    "NODE",
    "NORMAL",
    "NOT",
    "NOW",
    "NUMBER",
    "OBJECT",
    "OFF",
    "OLD",
    "ONCE",
    "ONE",
    "ONLY",
    "OPEN",
    "OPTIMIZE",
    "OR",
    "ORGANISM",
    "ORGANIZE",
    "OTHER",
    "OUR",
    "OUT",
    "OUTPUT",
    "OWN",
    "PARAMETER",
    "PART",
    "PARTICULAR",
    "PASS",
    "PATH",
    "PATTERN",
    "PENETRATE",
    "PEOPLE",
    "PERSON",
    "PICK",
    "PIECE",
    "PIERCE",
    "PIXEL",
    "PLACE",
    "PLANE",
    "PLANET",
    "PLANT",
    "PLAY",
    "PLEASE",
    "POINT",
    "POSITIVE",
    "POWER",
    "PREDICT",
    "PREFER",
    "PRESSURE",
    "PREVIOUS",
    "PROBABILITY",
    "PROBLEM",
    "PROCESS",
    "PRODUCE",
    "PRODUCT",
    "PROGRAM",
    "PUCK",
    "PULL",
    "PUSH",
    "PUT",
    "QUESTION",
    "RATHER",
    "READ",
    "REALLY",
    "REASON",
    "REASONABLE",
    "RECOGNITION",
    "RECOGNIZE",
    "REFERENCE",
    "REGION",
    "RELEVANT",
    "REMEMBER",
    "REPRESENT",
    "RESIST",
    "RESISTANCE",
    "REST",
    "RESULT",
    "RIGHT",
    "ROLL",
    "RUN",
    "SAID",
    "SAME",
    "SATELLITE",
    "SAY",
    "SCRIPT",
    "SECOND",
    "SEE",
    "SERIES",
    "SETTING",
    "SHARP",
    "SHE",
    "SHIP",
    "SHOW",
    "SIDE",
    "SIGN",
    "SIGNAL",
    "SIMPLE",
    "SING",
    "SLIPPERY",
    "SMALL",
    "SNOW",
    "SO",
    "SOLUTION",
    "SOME",
    "SORRY",
    "SORT",
    "SPACE",
    "SPACESHIP",
    "SPEAK",
    "SPECIFIC",
    "SPEED",
    "STAR",
    "START",
    "STATIONARY",
    "STAY",
    "STEP",
    "STILL",
    "STOP",
    "STRAIGHT",
    "STRONG",
    "STRUCTURE",
    "STUDY",
    "SUBSCRIBE",
    "SUM",
    "SURFACE",
    "SURROUNDING",
    "SYSTEM",
    "TABLE",
    "TAKE",
    "TALK",
    "TEACH",
    "TELL",
    "TEXT",
    "THAN",
    "THANK",
    "THATS",
    "THEIR",
    "THEN",
    "THERE",
    "THESE",
    "THEY",
    "THING",
    "THINK",
    "THIRD",
    "THOSE",
    "THOUSAND",
    "THROUGH",
    "THROW",
    "TIME",
    "TIP",
    "TOGETHER",
    "TOP",
    "TOTAL",
    "TOUCH",
    "TOWARDS",
    "TRACK",
    "TRAIN",
    "TRANSFORMER",
    "TRUE",
    "TRY",
    "TWO",
    "TYPE",
    "UNDERSTAND",
    "UNIFORM",
    "UP",
    "UPDATE",
    "USE",
    "USEFUL",
    "VACUUM",
    "VALUE",
    "VARIANT",
    "VARIOUS",
    "VECTOR",
    "VELOCITY",
    "VERY",
    "VIDEO",
    "WALL",
    "WANT",
    "WATCH",
    "WATER",
    "WAY",
    "WE",
    "WEIGHT",
    "WELL",
    "WHAT",
    "WHEEL",
    "WHEN",
    "WHERE",
    "WHETHER",
    "WHICH",
    "WHO",
    "WHY",
    "WIN",
    "WIND",
    "WORD",
    "WORK",
    "WORLD",
    "WRAP",
    "WRITE",
    "WRONG",
    "YEAH",
    "YEAR",
    "YES",
    "YOU",
    "YOUR",
    "YOURE",
    "YOUVE",
    "ZERO"
  ],
  "vocabulary": [
    "ABILITY",
    "ABLE",
    "ABOUT",
    "ACCELERATE",
    "ACCIDENT",
    "ACCORDING",
    "ACCURACY",
    "ACT",
    "ACTIVATE",
    "ACTIVE",
    "ACTUALLY",
    "ADAPTATION",
    "ADD",
    "ADJUST",
    "AFTER",
    "AGAIN",
    "AI",
    "ALL",
    "ALLOW",
    "ALMOST",
    "ALSO",
    "ALWAYS",
    "ANALOGY",
    "AND",
    "ANIMAL",
    "ANOTHER",
    "ANSWER",
    "ANY",
    "APPLY",
    "AREA",
    "AROUND",
    "AS",
    "ASK",
    "ASL",
    "ASSISTANT",
    "ASSOCIATED",
    "ASTEROID",
    "ATMOSPHERE",
    "ATTENTION",
    "AXE",
    "BACK",
    "BAD",
    "BALANCE",
    "BALL",
    "BECAUSE",
    "BECOME",
    "BEFORE",
    "BEHAVE",
    "BEHAVIOR",
    "BENEFIT",
    "BETWEEN",
    "BIG",
    "BIGGER",
    "BILLION",
    "BODY",
    "BOTH",
    "BRAIN",
    "BREAK",
    "BRIGHT",
    "BRING",
    "BUILD",
    "BUNCH",
    "BUT",
    "BUY",
    "BY",
    "CALCULATE",
    "CALL",
    "CAN",
    "CAR",
    "CARE",
    "CASE",
    "CAUSE",
    "CERTAIN",
    "CHALLENGE",
    "CHANGE",
    "CHATBOT",
    "CHIP",
    "CHOICE",
    "CHOOSE",
    "CHOSE",
    "CLASSIFY",
    "CLOSE",
    "COMBINE",
    "COME",
    "COMMON",
    "COMPLICATED",
    "COMPONENT",
    "COMPUTE",
    "COMPUTER",
    "CONNECT",
    "CONNECTION",
    "CONSTANT",
    "CONTACT",
    "CONTINUE",
    "CONVERT",
    "CORRESPOND",
    "COUPLE",
    "COURSE",
    "CRASH",
    "CUT",
    "CYCLE",
    "DATA",
    "DAY",
    "DECREASE",
    "DEEP",
    "DEFINE",
    "DESCENT",
    "DETERMINE",
    "DIAL",
    "DID",
    "DIFFERENT",
    "DIFFICULT",
    "DIGIT",
    "DIRECTION",
    "DISPLACEMENT",
    "DO",
    "DONT",
    "DOWN",
    "DRILL",
    "EACH",
    "EARTH",
    "EASY",
    "EDGE",
    "EITHER",
    "END",
    "ENERGY",
    "ENGINE",
    "ENTIRE",
    "ERROR",
    "EVEN",
    "EXACTLY",
    "EXAMPLE",
    "EXERT",
    "EXPECT",
    "EXPERIMENT",
    "EXPLAIN",
    "EXPRESSION",
    "EXTREME",
    "FEED",
    "FEEDBACK",
    "FEEL",
    "FEW",
    "FINAL",
    "FIND",
    "FINISH",
    "FIRING",
    "FIRST",
    "FLAT",
    "FLOOR",
    "FLY",
    "FOR",
    "FORCE",
    "FORM",
    "FRAME",
    "FRICTION",
    "FULL",
    "FUNCTION",
    "GAVE",
    "GENERATE",
    "GET",
    "GIVE",
    "GIVEN",
    "GLIDE",
    "GO",
    "GOAL",
    "GOOD",
    "GRADIENT",
    "GRAVITY",
    "GREATLY",
    "GROUND",
    "GROUP",
    "HAMMER",
    "HAND",
    "HANDWRITTEN",
    "HAPPEN",
    "HARD",
    "HATE",
    "HE",
    "HELLO",
    "HELP",
    "HERE",
    "HIDDEN",
    "HIGH",
    "HIT",
    "HOLD",
    "HOPE",
    "HORIZONTAL",
    "HOW",
    "HUMAN",
    "I",
    "ICE",
    "IDEA",
    "IF",
    "IMAGE",
    "IMAGINE",
    "IMPACT",
    "IMPORTANT",
    "INACTIVE",
    "INCREASE",
    "INDEPENDENT",
    "INDICATE",
    "INERTIA",
    "INFLUENCE",
    "INPUT",
    "INSIDE",
    "INTERACT",
    "INTERNET",
    "INTO",
    "INVOLVE",
    "IT",
    "JUMP",
    "JUST",
    "KEEP",
    "KICK",
    "KIND",
    "KNIFE",
    "KNOB",
    "KNOW",
    "LANGUAGE",
    "LARGE",
    "LAST",
    "LAYER",
    "LEAF",
    "LEARN",
    "LEFT",
    "LESS",
    "LET",
    "LETS",
    "LETTER",
    "LEVEL",
    "LIGHT",
    "LIKE",
    "LINE",
    "LINEAR",
    "LIST",
    "LITTLE",
    "LIVE",
    "LONG",
    "LOOK",
    "LOOP",
    "LOSE",
    "LOSS",
    "LOT",
    "LOVE",
    "LOW",
    "MACHINE",
    "MAGNITUDE",
    "MAKE",
    "MANY",
    "MASS",
    "MATH",
    "MATRIX",
    "MAXIMIZE",
    "MAYBE",
    "ME",
    "MEAN",
    "MECHANISM",
    "METER",
    "MIDDLE",
    "MINIMIZE",
    "MODEL",
    "MODERN",
    "MOMENT",
    "MORE",
    "MOTION",
    "MOTIVATED",
    "MOVE",
    "MUCH",
    "NAIL",
    "NEED",
    "NEGATIVE",
    "NETWORK",
    "NEURAL",
    "NEURON",
    "NEW",
    "NEXT",
    "NICE",
    "NO",
    "NODE",
    "NORMAL",
    "NOT",
    "NOW",
    "NUMBER",
    "OBJECT",
    "OFF",
    "OLD",
    "ONCE",
    "ONE",
    "ONLY",
    "OPEN",
    "OPTIMIZE",
    "OR",
    "ORGANISM",
    "ORGANIZE",
    "OTHER",
    "OUR",
    "OUT",
    "OUTPUT",
    "OWN",
    "PARAMETER",
    "PART",
    "PARTICULAR",
    "PASS",
    "PATH",
    "PATTERN",
    "PENETRATE",
    "PEOPLE",
    "PERSON",
    "PICK",
    "PIECE",
    "PIERCE",
    "PIXEL",
    "PLACE",
    "PLANE",
    "PLANET",
    "PLANT",
    "PLAY",
    "PLEASE",
    "POINT",
    "POSITIVE",
    "POWER",
    "PREDICT",
    "PREFER",
    "PRESSURE",
    "PREVIOUS",
    "PROBABILITY",
    "PROBLEM",
    "PROCESS",
    "PRODUCE",
    "PRODUCT",
    "PROGRAM",
    "PUCK",
    "PULL",
    "PUSH",
    "PUT",
    "QUESTION",
    "RATHER",
    "READ",
    "REALLY",
    "REASON",
    "REASONABLE",
    "RECOGNITION",
    "RECOGNIZE",
    "REFERENCE",
    "REGION",
    "RELEVANT",
    "REMEMBER",
    "REPRESENT",
    "RESIST",
    "RESISTANCE",
    "REST",
    "RESULT",
    "RIGHT",
    "ROLL",
    "RUN",
    "SAID",
    "SAME",
    "SATELLITE",
    "SAY",
    "SCRIPT",
    "SECOND",
    "SEE",
    "SERIES",
    "SETTING",
    "SHARP",
    "SHE",
    "SHIP",
    "SHOW",
    "SIDE",
    "SIGN",
    "SIGNAL",
    "SIMPLE",
    "SING",
    "SLIPPERY",
    "SMALL",
    "SNOW",
    "SO",
    "SOLUTION",
    "SOME",
    "SORRY",
    "SORT",
    "SPACE",
    "SPACESHIP",
    "SPEAK",
    "SPECIFIC",
    "SPEED",
    "STAR",
    "START",
    "STATIONARY",
    "STAY",
    "STEP",
    "STILL",
    "STOP",
    "STRAIGHT",
    "STRONG",
    "STRUCTURE",
    "STUDY",
    "SUM",
    "SURFACE",
    "SURROUNDING",
    "SYSTEM",
    "TABLE",
    "TAKE",
    "TALK",
    "TEACH",
    "TELL",
    "TEXT",
    "THAN",
    "THANK",
    "THEIR",
    "THEN",
    "THERE",
    "THESE",
    "THEY",
    "THING",
    "THINK",
    "THIRD",
    "THOSE",
    "THOUSAND",
    "THROUGH",
    "THROW",
    "TIME",
    "TIP",
    "TOGETHER",
    "TOP",
    "TOTAL",
    "TOUCH",
    "TOWARDS",
    "TRACK",
    "TRAIN",
    "TRANSFORMER",
    "TRUE",
    "TRY",
    "TWO",
    "TYPE",
    "UNDERSTAND",
    "UNIFORM",
    "UP",
    "UPDATE",
    "USE",
    "USEFUL",
    "VACUUM",
    "VALUE",
    "VARIANT",
    "VARIOUS",
    "VECTOR",
    "VELOCITY",
    "VERY",
    "VIDEO",
    "WALL",
    "WANT",
    "WATCH",
    "WATER",
    "WAY",
    "WE",
    "WEIGHT",
    "WHAT",
    "WHEEL",
    "WHEN",
    "WHERE",
    "WHETHER",
    "WHICH",
    "WHO",
    "WHY",
    "WIN",
    "WIND",
    "WORD",
    "WORK",
    "WORLD",
    "WRAP",
    "WRITE",
    "WRONG",
    "YEAR",
    "YES",
    "YOU",
    "YOUR",
    "ZERO"
  ]
}
